{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "I've developed a multi functioning browser incorporating Explorer 9, Chromium beta and apple. It seems to be functioning awesome !\nI have used the personalising that is offered through Windows and the power of the search by Google with a bit of sleek apple technology thrown in for stability. I am not quite sure if this is innovation of technology I have created or the sign of newer progress to come.\nCould some kind person let me know as I have done all this in less than two years with no advice or any outside help. It is fast and powerful and a pleasure to work with and I am loving it ! If honesty is the best policy in computer networking then pop me to top of that list as I have been open throughout, embracing the people along the way with positivity and encouragement to reach their full potential in the computing world.\nSharing ideas is the key !  If everyone had though of the same ideas before being individual and steadfast in your opinion that computing must operate as a multi-functioning resource to acheive the results we really require in this modern age.\nA message to everone involved 'Welcome to make web and not war' is synonomous with Microsoft, taking this in it's literal sense we have a responsibility which I embrace in discovering ones self and every person must adhere with a open heart.\nAnge x",
    "LastUpdatedDate": "2013-02-21T18:59:33.287-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "1code",
    "ReportedDate": "2011-12-04T06:21:04.97-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "opendoor.com",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 9953
  },
  "FileAttachments": [
    {
      "FileId": 3673,
      "FileName": "1 (340x815) (2).jpg",
      "DownloadUrl": ".\\3673"
    }
  ],
  "Comments": []
}