[
  {
    "Id": "646787",
    "ThreadId": "266371",
    "Html": "<p>Before any further reading please be advised that my English can be faulty but I need you to \"see\" and \"understand\" what I'm saying here. Don't dismiss or quit your reading just for the matter that it is not understandable in English. Please, analyze the graphics too: they speak for themselves</p>\n<p>This is the Northwind database plus two extra tables. If you see, besides the FK keys, there are only one column for gathering data in each extra table:</p>\n<p>Product_Detail in OrdeDetail_childrens and<br />ProductFeature in ProductFeatures</p>\n<p>That's all there is. No special requirements bu two simple varchar columns</p>\n<p><img src=\"http://i53.tinypic.com/2w4mt0n.jpg\" alt=\"\" width=\"699\" height=\"408\" /></p>\n<p>I need to gather data for Product <strong>Queso Cabrales</strong> in the Order <strong>VINET</strong> (To be stored column Product_Detail of the table OrderDetail_childrens).</p>\n<p>For that&nbsp;I need to show table ProductFeatures in a GridView, adding an extra column for gathering the data (a TextBox), displyaing existing ProductName and Order ShipName for&nbsp;allowing the user to enter data: Product_Detail column</p>\n<p>It must be seen that ProductFeature column has stored data already entered before.&nbsp;I need to gather Product_Detail instead. Dynamic Data does this well line by line, row by row, which is not goof if you have, let's say 50 features for a product, isn't it? So I'd expect the GridView to work <span style=\"text-decoration: underline;\"><strong>kind of spreadsheet for this extra column </strong></span>(TextBox) in the GridView <span style=\"text-decoration: underline;\"><strong>only</strong></span>. The others are there just to be displayed, They don't have to be in edit mode whatsoever</p>\n<p>How to save this gathered data in a different table than the one shown in the grid (must save in OrderDetail_childrens and not in ProductFeatures) and also saving all rows at once with a single keystroke</p>\n<p><strong>NOTE:</strong> In diagram below HEADERS SHOW COLUMNS NAME&nbsp;for Order_Detail_childrens INSTEAD OF ProductFeatures because that's how I had planned to solve this before, but I was wrong. Headers should be for ProductDetails instead <strong>(THIRD GRID BELOW)</strong></p>\n<p><img src=\"http://i56.tinypic.com/20kdg7s.jpg\" alt=\"\" /></p>\n<p><strong>OBVIOUSLY THE COLUMNS SHOWING (10248) AND (11) SHOULD BE DISPLAYING (Vinet) and (Queso Cabrales)</strong></p>\n<p>Is this really quite complicated or it's me that failing in writing this in a proper manner in the English language?</p>",
    "PostedDate": "2011-07-24T10:03:02.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "648721",
    "ThreadId": "266371",
    "Html": "<p>Hello</p>\r\n<p>Thank you for posting here.&nbsp; However, this forum is for discussing features and problems in All-In-One Code Framework, and for <a href=\"http://1code.codeplex.com/wikipage?title=Request%20Code%20Sample%20from%20Microsoft%20All-In-One%20Code%20Framework&amp;referringTitle=Documentation\">requesting code samples</a>. &nbsp; For technical questions related to Microsoft dev technologies, you can post them to the ASP.NET/MSDN forums.</p>\r\n<p>Thanks<br />Jialiang Ge<br />Program Manager<br />Microsoft All-In-One Code Framework</p>",
    "PostedDate": "2011-07-27T20:39:11.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "648794",
    "ThreadId": "266371",
    "Html": "<p>Sir, I must say respectfully that I was mislead to this place for a member Microsoft team (I don&rsquo;t know of which team or group or moderator)</p>\n<p>Check this out. This is the answer I received from having posted this very same question in the ASP.Net Dynamic Data &nbsp;Forum</p>\n<p>So, I don't know if I ever will receive help. Where to ask for help on this?</p>\n<p>I have also been said that for this kind of questions I'd rather look for professional PAID help (look last answer below)</p>\n<p>------------------------------------------</p>\n<p><strong><span style=\"font-size: 13.5pt;\">Thanks. Didn't know about this</span></strong></p>\n<p><span style=\"font-size: 12pt;\">07-24-2011 04:29 PM </span></p>\n<h3 class=\"post-title\"><a title=\"cts-mgraham\" href=\"http://forums.asp.net/members/cts-mgraham.aspx\">cts-mgraham</a></h3>\n<p><span style=\"font-size: 12pt;\">Hopefully Ajay can help, but this&nbsp;might be&nbsp;much trickier than it looks.&nbsp; <span style=\"text-decoration: underline;\"><strong>For these kinds of samples, please make requests to the <a title=\"All-in-one code framework\" href=\"../\" target=\"_blank\"><span style=\"color: blue;\">1code</span></a> site - that's what it's there for.</strong></span></span></p>\n<p>------------------------------------------</p>\n<p>Having said that I must warn you that it seems that there are not qualified people for answering questions in the ASP.Net Dynamic Data forum</p>\n<p>I have received some answers saying that they are there in a volunteer basis, that they are not receiving a salary and it seems that those are the reason why they avoid anseering questions</p>\n<p>Some of them, specifically in the Dynamic Data Forum, also argue that they don't know anything about Dynamic Data at all so they can't answer</p>\n<p>Where do we go for answers?</p>\n<p>This question has been made for years. Hasn't been answered yet</p>\n<p>When a person like me dares to bring all these issues to the day-light then they make you feel like a social pariah unworthy of having ever been considered part of the Microsoft family <span style=\"color: #c00000;\">(check post in red below)</span></p>\n<p>If I have ever lose my control and temper is because ASP.Net Dynamic Data is a product that HAS NO TECHNICAL SUPPORT</p>\n<p>Dynamic Data lacks of all a real-life programmer might expect to find to develop an application that can be put seriously into production but you'll find quickly that ASP.Net Dynamic Data doesn't even have documentation on the most basic aspects of its functioning,  of its framework and of its functionallity</p>\n<p>What will you say of an answer like this:</p>\n<p>------------------------------------------</p>\n<p><a name=\"4507798\"></a></p>\n<h3>Re: Your recent Moderator Alert</h3>\n<p class=\"date\">07-14-2011 07:11 PM</p>\n<h3 class=\"post-title\"><a title=\"Mikesdotnetting\" href=\"http://forums.asp.net/members/Mikesdotnetting.aspx\">Mikesdotnetting</a></h3>\n<div>\n<p>I don't think Rex Lin has visited these forums for years, despite what the Last Visited time might suggest on a member's profile...</p>\n<p><span style=\"text-decoration: underline;\"><strong>Dynamic Data? Good Luck! I think Steve Naughton is the only person in the world who has any interest in the subject.</strong></span></p>\n</div>\n<div class=\"comment-signiture\">Regards, Mike <br /> <a href=\"http://www.mikesdotnetting.com/\">My Site</a> | <a href=\"http://www.twitter.com/Mikesdotnetting\"> Twitter</a></div>\n<p>﻿------------------------------------------</p>\n<p>&nbsp;</p>\n<p>Also this from<a title=\"XIII\" href=\"http://forums.asp.net/members/XIII.aspx\"> XIII</a></p>\n<h3>Re: On erased posts</h3>\n<p class=\"date\">07-26-2011 08:50 PM</p>\n<div>\n<p>Hi,</p>\n<blockquote>\n<h4>Topolov</h4>\nfrom your side, for real?</blockquote>\n<p><strong>I'm interested in the product myself. But I think you're confusing some things here. I'm a moderator on voluntary basis, I don't work for Microsoft and unfortunately can't snap my fingers and poof DD becomes the luxury tool we all want it to be.  I'm in the same boat like yourself waiting for updates, new things, ...</strong></p>\n<blockquote>\n<h4>Topolov</h4>\nIf you look the questions here in this forum you might as well think that Dynamic Data programmers are a little dumb because we ask silly questions but truth is that on Dynamic Data there is nothing written, except Naughton's blog and some other ocassional  contributors, that really help you to customize strong and powerful applicatons</blockquote>\n<p><strong>I know, hence I asked like yourself towards Microsoft where are the new goodies.</strong></p>\n<blockquote>\n<h4>Topolov</h4>\nDon't blame us, you abandoned a product and at the same time abandoned its users too</blockquote>\n<p><strong>I didn't personally abandon anything as I don't own it in the first place. I don't work for Microsoft at this moment nor did in the past.</strong></p>\n<p>Grz, Kris.</p>\n</div>\n<div class=\"comment-signiture\"><strong><a href=\"http://blog.krisvandermast.com/\">Read my blog</a> | <a href=\"http://twitter.com/#%21/KvdM\">Twitter</a></strong> <br /> Please don't ask me questions via pm. Simply ask them in the most appropriate forum. <br /> New question &gt; new thread</div>\n<p>------------------------------------------</p>\n<p><a name=\"4482795\"></a></p>\n<h3>Re: (Adding Features) GridViews</h3>\n<p class=\"date\">06-29-2011 05:57 AM</p>\n<div>\n<p>Hello Topolov：）</p>\n<p><strong>Sorry not an expert in DD,</strong> And I'm just confirming whether you've received my mail or not.</p>\n<p>Don't feel worried ;)</p>\n</div>\n<div class=\"comment-signiture\">Please mark the replies as answers if they help or unmark if not. <br /> <br /> If you have any feedback about my replies, please contact msdnmg@microsoft.com. <br /> <br /> <a href=\"http://bit.ly/ejwBWR\">Microsoft One Code Framework</a></div>\n<div class=\"comment-signiture\">-------------------------------</div>\n<div class=\"comment-signiture\">\n<div class=\"comment-signiture\">\n<p><span style=\"color: #c00000;\">Your post was deleted by Song-Tian - MSFT.</span></p>\n<p><span style=\"color: #c00000;\">Subject: On priorities and losing my job</span></p>\n<p><span style=\"color: #c00000;\">Reason: Hello,</span></p>\n<p><span style=\"color: #c00000;\">You attempted to create a new thread on the ASP.NET Forums with the following message:</span></p>\n<p><span style=\"color: #c00000;\">________________________________________________________</span></p>\n<p><span style=\"color: #c00000;\">When you mention Dynamic Data is something that is automatically re-dierected to Steve Naughton's responsability only, and he is just a contributor Why do you guys think that our timing for develpoing applications doesn't have deadlines and importance too I AM ABOUT TO LOSE MY JOB BECAUSE I CAN'T ACCOMPLISH MY TIMEFRAME USING DYNAMIC DATA Bad luck for me that I found Dynamic Data but you put it there available to us So my reasoning is: if you invented Dynamic Data then give it proper support and provide answers and solutions I feel with Dynamic Data as if I bought a car with a lot of \"probable features to come\" which are never going to be released I feel like a bought a car that doesn't have a fuel tank, neither it has engine</span></p>\n<p><span style=\"color: #c00000;\">________________________________________________________</span></p>\n<p><span style=\"color: #c00000;\">Your message is unrelated to the topic of the ASP.NET Forums. As a consequence, your message has not been approved. Perhaps you can use Bing.com to find a more relevant community service for your message.</span></p>\n<p><span style=\"color: #c00000;\">Here is a list of technical sites that may be helpful: http://forums.asp.net/p/1337412/2699239.aspx#2699239</span></p>\n<div class=\"comment-signiture\">-------------------------------------------</div>\n<div class=\"comment-signiture\">ABOUT PAID SUPPORT</div>\n<h3>Re: Bubbling events among field templates and filters</h3>\n<p class=\"date\">04-18-2011 05:34 PM</p>\n<div>\n<p>I'm afraid that I don't know how to achieve this off of the top of my head, and I couldn't find any samples here.&nbsp; <span style=\"text-decoration: underline;\"><strong>Your question falls into the paid support category</strong></span></p>\n<p>which requires a more in-depth level of support.&nbsp; Please visit the  below link to see the various paid support options that are available to  better meet<br /> your needs. <span style=\"text-decoration: underline;\"><a href=\"http://support.microsoft.com/default.aspx?id=fh;en-us;offerprophone\">http://support.microsoft.com/default.aspx?id=fh;en-us;offerprophone</a></span></p>\n<p>The thread is still open if anyone else has a sample for Topolov.&nbsp; I  wish you luck, and if I do come across anything that I believe will help  you, i will post back.</p>\n</div>\n<div class=\"comment-signiture\">Michael Graham, MSFT</div>\n-------------------------------------------</div>\n</div>",
    "PostedDate": "2011-07-28T01:25:11.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]