[
  {
    "Id": "680015",
    "ThreadId": "274766",
    "Html": "\r\n<p>I'm using LinqToXSD to generate document models (code) based on a client's XSD's. Since these XSD's share common structure each time I generate a document model some objects get duplicated. To prevent compile problems, I've put each document model in its\r\n own name space. This has worked great. But now I want to do some custom validation with these objects which are public partial classes. So I defined a IValidate interface with a single Validate() method. Can you see the problem yet? Here goes, now I have some\r\n low level object generated in more than one object model but each in a different namespace.</p>\r\n<div style=\"color:black; background-color:white\">\r\n<pre>namespace1\r\n{\r\n    <span style=\"color:blue\">public</span> <span style=\"color:blue\">partial</span> <span style=\"color:blue\">class</span> foo : XTypedElement\r\n       {........}\r\n}\r\n\r\nnamespace2\r\n{\r\n    <span style=\"color:blue\">public</span> <span style=\"color:blue\">partial</span> <span style=\"color:blue\">class</span> foo : XTypedElement\r\n       {........}\r\n}\r\n</pre>\r\n</div>\r\n<p>Now I want to write a single partial class file to add IValidate interface and the Validate() method across all my foo classes. But, of course this want work because they are in reality different objects. I have lots of these because of the generated code\r\n and the XSD library used to generate the code. If I could just shadow the internals (read the '......'s above) this would work. I have many\r\n<em>foo</em>'s in different namespaces (and I have <em>foo1 through foo100</em> each with the same issue). I need to duplicate code, I know it's a no-no and I don't want to have to do it. But, if I do, I at least do not want to have to maintain so many copies\r\n of the same code. I'm fairly confident this can be done with dynamics but I'd rather not have to go there. Can anyone suggest some other way to write these validation methods and not have to manually copy to each namespace.class's partial class?</p>\r\n",
    "PostedDate": "2011-10-04T14:16:18.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]